# Запитуємо рядок від користувача
text = input('Введіть будь-який рядок: ')

# Виводимо третій символ рядка
print('Третій символ рядка:', text[2])

# Виводимо передостанній символ рядка
print('Передостанній символ рядка:', text[-2])

# Виводимо перші п'ять символів рядка
print('Перші п\'ять символів рядка:', text[:5])

# Виводимо весь рядок, крім двох останніх символів
print('Рядок без двох останніх символів:', text[:-2])

# Виводимо усі символи з парними індексами
print('Символи з парними індексами:', text[::2])

# Виводимо усі символи з непарними індексами
print('Символи з непарними індексами:', text[1::2])

# Виводимо усі символи у зворотному порядку
print('Рядок у зворотному порядку:', text[::-1])

# Виводимо усі символи рядка через один у зворотному порядку, починаючи з останнього
print('Рядок через один у зворотному порядку:', text[-1::-2])

# Виводимо довжину рядка
print('Довжина рядка:', len(text))
